# StairNotEnoughRiserCurves Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..StairNotEnoughRiserCurves Property
BuiltInFailures..::..SketchFailures Class See Also
---
Boundaries (chains of one or more Boundary Lines) must be connected by at least two Riser Lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairNotEnoughRiserCurves { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairNotEnoughRiserCurves As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairNotEnoughRiserCurves {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace